Chapter03/LoanOriginationProcess/LoanOrigination/SOA/testsuites/LOProcessAsService.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:StartLoanOrigination xmlns:ns1="http://xmlns.oracle.com/bpmn/bpmnProcess/LOProcessAsService"
                              xmlns:ns2="http://www.myloanoriginationsystem.org">
      <ns2:LoanRequest>
        <ns2:LoanDetails>
          <ns2:ApplicantID>1000</ns2:ApplicantID>
          <ns2:Product>ABC1000</ns2:Product>
          <ns2:Amount>1000</ns2:Amount>
          <ns2:ApplicationDate>2014-12-12T00:00:00</ns2:ApplicationDate>
          <ns2:Channel>WEB</ns2:Channel>
          <ns2:Source>WEB</ns2:Source>
          <ns2:InterestRate>1</ns2:InterestRate>
          <ns2:UpdateDate>2014-12-12T00:00:00</ns2:UpdateDate>
          <ns2:LoanOfficer>salesrep</ns2:LoanOfficer>
          <ns2:LoanSalesRep>salesrep</ns2:LoanSalesRep>
          <ns2:LoanProcessor>salesrep</ns2:LoanProcessor>
          <ns2:LoanStatus>NEW</ns2:LoanStatus>
          <ns2:LoanPurpose>Home</ns2:LoanPurpose>
          <ns2:Terms>36</ns2:Terms>
          <ns2:PaymentFrequency>Yearly</ns2:PaymentFrequency>
        </ns2:LoanDetails>
        <ns2:ApplicantDetails>
          <ns2:ApplicantInformation>
            <ns2:Salutation>Miss</ns2:Salutation>
            <ns2:FName>Christine</ns2:FName>
            <ns2:MName>R</ns2:MName>
            <ns2:LName>R</ns2:LName>
            <ns2:DateOfBirth>2014-12-12T00:00:00</ns2:DateOfBirth>
            <ns2:SSN_Or_TAX>123456789</ns2:SSN_Or_TAX>
            <ns2:ApplicantType>Self</ns2:ApplicantType>
            <ns2:Gender>Female</ns2:Gender>
            <ns2:MaritialStatus>Single</ns2:MaritialStatus>
            <ns2:Nationality>US</ns2:Nationality>
            <ns2:Attribute1>1</ns2:Attribute1>
            <ns2:Attribute2>2</ns2:Attribute2>
          </ns2:ApplicantInformation>
          <ns2:Address>
            <ns2:Line1>SomeAddress1</ns2:Line1>
            <ns2:Line2>SomeAddress1</ns2:Line2>
            <ns2:City>Miami</ns2:City>
            <ns2:County>Miami</ns2:County>
            <ns2:State>FL</ns2:State>
            <ns2:Country>US</ns2:Country>
            <ns2:Zip>33333</ns2:Zip>
            <ns2:LivingSince>2014-12-12T00:00:00</ns2:LivingSince>
          </ns2:Address>
          <ns2:Contact>
            <ns2:Email>a@b.com</ns2:Email>
            <ns2:HomePhone>12365412</ns2:HomePhone>
            <ns2:WorkPhone>12365412</ns2:WorkPhone>
            <ns2:CellPhone>12365412</ns2:CellPhone>
            <ns2:Fax>12365412</ns2:Fax>
          </ns2:Contact>
          <ns2:IncomeEmployment>
            <ns2:Occupation>IT</ns2:Occupation>
            <ns2:YGross>200000</ns2:YGross>
            <ns2:TotalIncome>200000</ns2:TotalIncome>
            <ns2:EmployeeName>SomeEmployee</ns2:EmployeeName>
            <ns2:JobTitle>Manager</ns2:JobTitle>
            <ns2:StartDate>2014-12-12T00:00:00</ns2:StartDate>
            <ns2:EndDate>2014-12-12T00:00:00</ns2:EndDate>
            <ns2:EmployeePhone>12365412</ns2:EmployeePhone>
            <ns2:EmployeeAddress>SomeAddressInMiami</ns2:EmployeeAddress>
          </ns2:IncomeEmployment>
        </ns2:ApplicantDetails>
        <ns2:LoanStatus>New</ns2:LoanStatus>
      </ns2:LoanRequest>
    </ns1:StartLoanOrigination>
  </soap:Body>
</soap:Envelope>
